{
  "${ModID}:TowerEnter": {
    "NAME": "The Tower",
    "DESCRIPTIONS": [
      "Oh boy! A tower! I just love towers! They're so tall and thick! But thinner ones are fine too, or even short and squat ones! The variety in shapes just gets me so excited! Look at that! It's made out of rocks! Do you know what kind of rock this is? I don't! But they look really nice. Do you think they look nice?"
    ],
    "OPTIONS": [
      "[Enter] Oh boy, I can't wait to go inside this tower!",
      "[Leave] Don't risk it, take the treasure"
    ]
  },
  "${ModID}:Example": {
    "NAME": "An Event",
    "DESCRIPTIONS": [
      "Initial Selection",
      "This is Brazil. You can only go to Antarctica from here.",
      "This is Japan. You can go to Brazil or Trip and Fall.",
      "This is Antarctica. You can Trip and Fall.",
      "Ouch."
    ],
    "OPTIONS": [
      "[Go to Brazil]",
      "[Go to Japan]",
      "[Go to Antarctica]",
      "[Trip and fall]",
      "[Bye]",
      "[Fight your way to Japan]"
    ]
  },
  "${ModID}:EmeraldFlame": {
    "NAME": "Emerald Flame",
    "DESCRIPTIONS": [
      "You happen upon a group of what looks like #bblue #bfire #bspirits ~dancing~ around a large bonfire. NL ",
      "The spirits toss small bones and fragments into the #gfire, which ~brilliantly~ ~erupts~ each time. NL As you approach, the spirits all turn to you, expectantly... NL ",
      "They also are eyeing one of your #yrelics...",
      "You toss your card into the bonfire and grab a piece of #gkindling. The card @bursts,@ and its ashes ~swirl~ around the torch you grabbed! NL NL ",
      "It burns a #gbright #gemerald and is embedded with the power of your offering. NL NL You notice that it starts to fade very slowly as you walk away...",
      "Choose a Card",
      "The #bspirits immediately toss your ",
      " into the #gbonfire. NL NL #g@They@ #g@revel@ #g@as@ #g@it@ #g@bursts@ #g@into@ #g@flames!@ NL NL ...You decide it's best to take your leave."
    ],
    "OPTIONS": [
      "[Offer: ",
      "] #rLose #rthis #rrelic. #gChoose #ga #grare #gCard #gto #gobtain.",
      "[Offer a Card] #rLose #r",
      " #rHP. Pick up a #yTorch.",
      "Select a Card to Offer.",
      "[Leave]"
    ]
  },
  "${ModID}:OttoEvent": {
    "NAME": "A Game for a Golem",
    "DESCRIPTIONS": [
      "While ascending the battle tower, you can't help but notice an absolutely massive golem, sitting alone at a table formed from earth. NL NL \"Otto meet new friend! Play game with Otto? Otto give prize!\" NL NL You glance down and notice a black and white checkered board with carved pieces. It would appear you've been invited to play.",
      "It doesn't seem to be able to make much in the way of facial expression, but you can tell the golem is delighted that you've decided to play.",
      " NL NL Despite your best efforts, this Golem clearly knows this game better than you. You've lost your ante, but made a new friend.",
      " NL NL Otto knows this game very well, but you deploy a wild and unconventional strategy, somehow securing the victory. You win not only Otto's ante, but also its friendship.",
      " NL NL Three turns later, you seal the win by swapping two pieces with some clever slight of hand. \"Otto confused... but you win.\". You receive the gold as promised and quickly depart the table before Otto realizes that it has been swindled.",
      "Even though the golem appears friendly, you decide you don't have time to stop for entertainment. You have a Battle Tower to climb!",
      "The golem takes an age to process this offer, glancing down at the deck of cards sitting beside its black and white table. After several minutes, it reaches down, grabs the deck, and accepts your trade. NL NL Although the golem doesn't appear to be able to express much emotion, you can tell it remains disappointed you decided not to play its game."
    ],
    "OPTIONS": [
      "[Locked] Requires 1 Uncommon and 1 Rare card.",
      "[Trade Deck] #rRemove #r1 #rUncommon #rand #r1 #rRare #rcard. #gGain #gOtto’s #gDeck.",
      "[Play Fair] #g50%: #gWin #g75 #gGold. #r50%: #rLose #r75 #rGold.",
      "[Locked] Requires 75 Gold.",
      "[Cheat] #gWin #g75 Gold. #rBecome #rCursed #r- #rShame",
      "[Leave]",
      "Choose a Card to Remove."
    ]
  },
  "${ModID}:BannerSageEvent": {
    "NAME": "The Banner Sage",
    "DESCRIPTIONS": [
      "Oddly enough, this Battle Tower houses a small shopping district. You spot a most beautiful banner of colored red silk, held by a war-torn elderly Giant. He spots you among the customers and gestures you forward with his only remaining arm. NL NL \"Greetings, friend. Name's River,\" the hulking man says. \"Can I interest you in a unique, hand-crafted battle standard?\"",
      "Never before have you seen such delicate craftsmanship! You simply must have this gorgeous war banner on offer, and happily pay the price. River thanks you for your patronage as you and your new incredible banner continue up the tower.",
      "River seems like a tough opponent, but with the other customers here, you realize he couldn't risk leaving his wares in the open. There's nothing stopping you from grabbing one and running, and that thought is just too tempting. NL NL As you make haste with your new banner in hand, the fabric becomes excruciating to touch! Suddenly, the cloth changes from a vibrant warm color to a harsh deep purple, and where once was an embroidered image now lies a horribly inked skull. It appears the Giant had some protection on his wares after all.",
      "Although these tapestries are incredibly well-made, they aren't a smart use of your funds right now. You browse for awhile, but then continue up the Battle Tower."
 ],
    "OPTIONS": [
      "[Locked] Requires 90 Gold.",
      "[Buy] #rSpend #r90 Gold. ",
      "[Steal] #gGain #gCursed #gTapestry. #rBecome #rCursed #r- #rPain.",
      "[Leave]"
    ]
  },
  "${ModID}:PotOfGoldEvent": {
    "NAME": "Pot of Gold",
    "DESCRIPTIONS": [
      "You stumble upon a glimmering pot, sitting plainly in a hallway of the Battle Tower. You don't see anyone around to guard it, but gold pieces fill it to the brim! A sign next to it reads: NL NL #bGive #bto #band #bdo #bnot #btake #bfrom #bthis #bshiny #bbowl, NL #bFor #bavarice #bpoisons #band #bblackens #bthe #bsoul...",
      "As you drain the pot of its last gold piece, the sign transforms before your eyes, the words reshaping and turning purple. It now reads: NL NL #pThough #pyour #ppockets #pare #pnow #plined #pwith #pgold, NL #pA #psteeper #ppayment #pmust #pnow #punfold. NL NL ",
      "You leave the empty pot behind, slightly concerned that you've been inflicted with some horrible spell.",
      "Though slightly concerned that you've been inflicted with some horrible spell, you decide that the damage has already been done. No sense leaving behind this useful pot.",
      "Heeding the words of warning on the sign, you scoop some gold coin out of your pack and drop them into the pot. The sound of the gold landing reverberates nicely in the metal chamber, creating a most enjoyable sound. NL NL Hopefully other adventurers more in need than you are will appreciate this bounty.",
      "Whoever wrote this warning surely put some sort of curse or spell upon it, inflicting something upon anyone who takes from it. That kind of magic could be useful. NL NL Like everyone, you know how to negate whatever this enchantment is. You rip the sign from the post on the ground and smash it over your head! Ow! NL NL The sign explodes into purple dust, raining down into your body and invigorating it with new power. When you recover from your head injury and look back to claim the pot, it is no longer there. The City's thieves must have been keeping an eye out for just such an opportunity to swipe the loot."
    ],
    "OPTIONS": [
      "[Donate] #rLose #r20 Gold. #gGain #gLucky.",
      "[Locked] Requires 20 Gold.",
      "[Take Gold] #gGain #g75 Gold. #rCursed #r- #rGreedy.",
      "[Take Pot] #gGain #g75 Gold #gand #gIron #gPot. #rCursed #rTwice #r- #rGreedy.",
      "[Disenchant] #rLose #r5 #rHP. #gGain #gDark #gEnchantment.",
      "[Leave]"
    ]
  },
  "${ModID}:GenieLamp": {
    "NAME": "A Wish",
    "DESCRIPTIONS": [
      "#y@Clank@ \"Let's go boys, this thing is useless.\", the three #rthugs leave the room you saw on your way up. NL NL A quick peek reveals a dark room filled with indistinct shapes but for the #y~lamp~ right in the middle. NL NL As if bewitched, you reach and #psmoke #p~billows~ out. NL NL \" #p~Ki~ #p~O'Dini~ #p~will~ #p~make~ #p~your~ #p~wish~ #p~come~ #p~true.~ \",",
      "\" #p~Knowledge~ #p~in~ #p~abundance~ .\" With those words, the #pspirit disappears.",
      "\" #p~Wealth~ #p~attracts~ #p~greed~ .\" With those words, the #pspirit disappears.",
      "@Smoke@ @envelops@ @you!@ NL NL Within the span of a blink, you stand outside the tower. A faint ~whisper~ carries on the wind, \" #pExchanging #pone #pprison #pfor #panother.\""
    ],
    "OPTIONS": [
      "[Knowledge] #yRecieve #ya #yspecial #ycard.",
      "[Wealth] #gReceive #g%d #gGold. #rRelics #rat #rthe #rshops #rare #rmore #rexpensive.",
      "[Freedom] #rLeave the #yBattle #yTower",
      "Continue."
    ]
  },
  "${ModID}:RoarOfTheCrowd": {
    "NAME": "Roar of the Crowd",
    "DESCRIPTIONS": [
      "You pause briefly on your climb up the tower to appreciate the crowd cheering you on. This place might not be as popular as the #bColosseum yet, but it's getting there. NL NL In fact, the crowd is so excited that they've swarmed into the tower and are blocking your way forward! You'll have to bargain to make your way through. NL NL You spot two good prospects: a #pbird-masked #pfigure that wants your #rblood but will reward you with #ygold, and a #bblue #bhumanoid that will #gbless you in return for a small #ydonation.",
      "The loss of blood #r~hurts,~ but you think of the #yriches that await you.",
      "Seeing that are already on the threshold of #rdeath, the cultist lets you pass unharmed. If you can achieve victory from here, you deserve the reward.",
      "A soft green glow envelops your body and dissipates. NL The creature grins. \"Cleric finest protector. @Have@ @a@ @good@ @day!\"@"
    ],
    "OPTIONS": [
      "[Cultist] #rLose #r{0} #rHP. #gGain #g{1} #ggold #gwhen #gyou #gdefeat #gthe #gtower #gboss.",
      "[Cleric] #rLose #r{0} #rGold. #gGain #g{1} #gDexterity #gfor #gthe #grest #gof #gthe #gtower.",
      "[Locked] Requires {0} Gold.",
      "[Leave]"
    ]
  },
  "${ModID}:ArmorerEvent": {
    "NAME": "The Armorer",
    "DESCRIPTIONS": [
      "Apply 1 Vulnerable.",
      "Apply 1 Weak.",
      "Draw 1 card.",
      "Gain 2 Frail.",
      "Gain 1 Vulnerable.",
      "Gain 2 Weak.",
      "Exhaust.",
      "Ethereal.",
      "-2 Damage & Block.",
      "Innate.",
      "Retain.",
      "+2 Damage & Block.",
      "Choose an #yAttack or #ySkill Card to #gBoon: '",
      "'.",
      "The faint sound of metal clanging on metal pulls you toward a hidden pathway to an alcove in the Tower. Inside, you find a #rred-cloaked #rAwakened #rCultist hammering away, forging a curved metal stick. NL NL \"You weren't supposed to see this. Our #bcult demands the outsiders think of us as dim-witted, so they may remain ignorant of our true potential. NL NL Our #bsecrecy is our #ysurvival. Our #ysurvival is our #rstrength. NL NL If you swear yourself to secrecy and forget you ever saw this place, I will use the #yforge as best I can in exchange.\"",
      "\"The forge demands #bbalance in all things. For one to be #ystrengthened, another must #rfalter.\"",
      "\"This one's #rsacrifice will not be in vain. Choose wisely.\"",
      "The Armorer is clearly a #ymaster of her craft, and it does not take long before the forging is complete. NL NL \"May this blessing be a #bgift for your journey. The forge remains lit for awhile longer... with payment of #rblood or #ygold, the metal can be shaped many ways.\"",
      "With a final sizzle, the Forge's glow goes dark, #yilluminated only by the remaining #yheat in the Armorer's tools. She looks exhausted, and #rcollapses onto a bench after returning your gear to you. NL NL \"Go now - and #bremember of your oath. You shall tell #rno #rone of what you have learned here today.\"",
      "You decline to have the Armorer further alter your equipment. NL NL \"Go now - and remember of your #boath. You shall tell #rno #rone of what you have learned here today.\"",
      "Again, the Armorer forges your equipment with #bmasterful #bskill. \"The forge has just enough #rfuel for one last forging. If... you still wish to #rpay the toll.\"",
      "Choose an #yAttack or #ySkill Card to #rBane: '",
      "After the battle, you pluck the iron mask from the #rArmorer's #rhead and don it on your own. Whatever #pdeceptions these #bCultists were pulling doesn't matter - these cultists have attacked you and many others. #rThey #rdeserved #rto #rdie."
    ],
    "OPTIONS": [
      "[Keep Secret] Add 1 #gBoon and 1 #rBane modifier to 2 #yAttack or #ySkill cards.",
      "[Pay in Blood] #rLose #r10 #rHP.",
      "[Pay in Gold] #rLose #r40 Gold.",
      " Modify more cards.",
      "[Locked] No viable cards to gain: '",
      "[Locked] Already used.",
      "[Leave]",
      "[Slay] #rFight! #gGain #gArmorer's #gHeadpiece.",
      "[Locked] Can't afford."
    ]
  }
}