{
  "${ModID}:TowerEnter": {
    "NAME": "Башня",
    "DESCRIPTIONS": [
      "Вы стоите на распутье. Желаете узнать #bпростую тайну бесхозного сундука с сокровищами или принять #r~вызов~ башни в далеке? NL NL Выбор ваш."
    ],
    "OPTIONS": [
      "[Башня] Зов башни так заманчив.",
      "[Сундук] Сокровище должно принадлежать вам."
    ]
  },
  "${ModID}:Example": {
    "NAME": "An Event",
    "DESCRIPTIONS": [
      "Initial Selection",
      "This is Brazil. You can only go to Antarctica from here.",
      "This is Japan. You can go to Brazil or Trip and Fall.",
      "This is Antarctica. You can Trip and Fall.",
      "Ouch."
    ],
    "OPTIONS": [
      "[Go to Brazil]",
      "[Go to Japan]",
      "[Go to Antarctica]",
      "[Trip and fall]",
      "[Bye]",
      "[Fight your way to Japan]"
    ]
  },
  "${ModID}:EmeraldFlame": {
    "NAME": "Изумрудное пламя",
    "DESCRIPTIONS": [
      "Вы натыкаетесь на группу #bсиних #bогненных #bдухов, ~танцующих~ вокруг большого костра. NL ",
      "Духи бросают мелкие косточки и обломки в огонь, и тот каждый раз ~ярко~ ~вспыхивает.~ NL Вы подходите ближе, и духи выжидающе смотрят на вас... NL ",
      "Ещё они глазеют на одну из ваших #yреликвий...",
      "Вы бросаете карту в огонь и забираете из него веточку #gкостра. Карта @вспыхивает,@ а её пепел ~закружил~ в пламени факела, который вы недавно подобрали! NL NL ",
      "Его цвет стал #gярко #gизумрудным и он слился с силой карты. NL NL По дороге вы замечаете, что он начинает потихоньку затухать...",
      "Выберите карту",
      "#bДухи тут же бросают ",
      " в #gогонь. NL NL #g@Они@ #g@наслаждаются@ #g@её@ #g@сжиганием@ #g@в@ #g@костре!@ NL NL ...Вы решаете, что лучше будет уйти."
    ],
    "OPTIONS": [
      "[Предложить: ",
      "] #rПотерять #rэту #rреликвию. #gВыбрать #gРедкую #gкарту #gи #gдобавить #gеë #gв #gколоду.",
      "[Предложить карту] #rПотерять #r",
      " #rОЗ. Получить #yФакел.",
      "Выберите карту, которую хотите предложить.",
      "[Уйти]"
    ]
  },
  "${ModID}:VoidShrine": {
    "NAME": "Пустой алтарь",
    "DESCRIPTIONS": [
      "Перед вами #pзаброшенный алтарь, пульсурующий слабой, #pпотусторонней энергией. NL NL Чувствуя как он тянет вас, вы осознаёте, что он желает вашеё #rкрови, #yбогатства или саму #pдушу.",
      "Вы предлагаете алтарю несколько капель #rкрови и чувствуете прилив сильной #pусталости. NL NL Когда вы проснуллись, алтаря уже нигде не было.",
      "Вы предлагаете алтарю мелкую горстку #yзолота и чувствуете напллыв сильного головокружееияyou. NL NL Придя в сознание, вы не обнаружили никакого алтаря.",
      "Вы шагнули вперёд и предложили алтарю себя. Сильная #pболь ~пронзает~ пронзает ваше тело, #bледяная волна проходит по венам, отделяя часть вас. NL NL Наконец, это заканчивается, а вы остались с чувством #pпустоты внутри себя."
    ],
    "OPTIONS": [
      "[Предложить кровь] ",
      "Потерять ",
      " ОЗ.",
      "Добавить карте в колоде «Сжигается».",
      "[Предложить богатство] ",
      " золота.",
      "Добавить карте в колоде «Эфирная».",
      "[Предложить душу] ",
      "Убрать ",
      " карты из колоды.",
      "Получить особую реликвию.",
      "Выберите карту",
      "[Уйти]",
      "[Закрыто] Требуется золото."
    ]
  },
  "${ModID}:OttoEvent": {
    "NAME": "Игра для голема",
    "DESCRIPTIONS": [
      "Поднимаясь по башне, вы не могли не заметить очень огромного голема, одиноко сидящего за столом из земли. NL NL «Отто встретил друга! Сыграешь с Отто? Отто даст награду!» NL NL Вы опускаете взгляд вниз и замечаете чёрно-белую доску с вырезанными фигурами. Похоже, вас пригласили сыграть.",
      "Не похоже, что голем может показывать особо много эмоций, но вы можете сказать, что он доволен вашим согласием поиграть.",
      " NL NL Несмотря на ваши усилия, он, очевидно, знает эту игру лучше, чем вы. Хотя вы и проиграли ставку, но получили нового друга.",
      " NL NL Отто очень хорошо знает эту игру, но вы использовали дикую и необычную стратечию, что привело к вашей победе. Так вы обзавелись не только горсткой денег, но и новым другом.",
      " NL NL Через три хода, вы побеждаете заменив пару фигур ловким движением рук. «Отто не понимает... но ты победил.». Вы забираете золото и быстро покидаете стол голема, прежде чем он поймёт, что его обманули.",
      "Хоть голем и дружелюбный на вид, вы решаете не тратить время на развлечения. Нужно дойти до конца башни!",
      "Голем вечность обдумывал ваше предложение, смотря на колоду карт рядом с его чёрно-белой доской. Через несколько минут, он наклоняется за колодой и принимает ваше предложение. NL NL Не похоже, что голем может показывать особо много эмоций, но вы можете сказать, что он остался разочарован тем, что вы не решились сыграть с ним."
    ],
    "OPTIONS": [
      "[Закрыто] Требуется 1 Необычная и 1 Редкая карта.",
      "[Купить доску] #rУбрать #r1 #rНеобычную #rи #r1 #rРедкую #rкарту. #gПолучить #gOtto’s #gDeck.",
      "[Сыграть честно] #g50%: #gПолучить #g75 #gзолота. #r50%: #rПотерять #r75 #rзолота.",
      "[Закрыто] Требуется 75 золота.",
      "[Жульничать] #gПолучить #g75 #gзолота. #rПолучить #rПроклятие #r- #rСтыд",
      "[Уйти]",
      "Выберите карту, которую хотите убрать."
    ]
  },
  "${ModID}:BannerSageEvent": {
    "NAME": "Сага о знамени",
    "DESCRIPTIONS": [
      "Как ни странно, в башне есть небольшой торговый район. Вы замечаете самое красивое знамя из красного шёлка, которое держит гигант в боевых шрамах. Он замечает вас в толпе и приглашает подойти свободной рукой. NL NL «Приветсвую, иой друг. Ривером звать», - сказал громоздкий мужчина. «Вас интересуют уникальные боевые штандарты ручной работы?»",
      "Вы никогда не видели такого искусного мастера! Вам просто необходим это великолепное боевое знамя и вы с радостью платите за него. Ривер благодарит вас за покупку, вы вместе со своим невероятным штандартом продолжаете восхождение.",
      "Ривер на вид суровый соперник, но ему нельзя было оставлять товар на виду в толпе посетителей. Ничто не мешает вам схватить один из них и убежать, эта мысль не даёт вам покоя. NL NL Удирая с новым знаменем в руках, ткань становится невыносимо держать! Внезапно цвет ткани меняется с яркого тёплого на тёмно-фиолетовый, а на месте вышитого узора красуется ужасно нарисованный череп. Видимо, у гигнта всё же былы какая-то защита от воров.",
      "Хотя эти гобелены невероятно хорошо сделаны, сейчас он не являются разумным использованием золота. Вы осматриваете их некоторое время и продложвете покорение башни."
    ],
    "OPTIONS": [
      "[Закрыто] Требуется 90 золота.",
      "[Купить] #rПотерять #r90 золота. ",
      "[Украсть] #gПолучить #gПроклятый #gгобелен. #rПолучить #rПроклятие #r- #rБоль.",
      "[Уйти]"
    ]
  },
  "${ModID}:PotOfGoldEvent": {
    "NAME": "Горшочек золота",
    "DESCRIPTIONS": [
      "Вы натыкаетесь на #y~сверкающий~ горшочек, которы стоит прямо посреди коридора башни. Вы не видите никакой охраны вокруг, но он забит #yзолотыми монетами до краёв! На табличке рядом с горшочком написано: NL NL #b«Клади, #bно #bне #bзабирай. NL #bАлчности #bты #bсебя #bне #bотдавай...»",
      "Опустошив горшочек до самой последней #yзолотой монеты, вывеска изменяется на ваших глазах, слова преображаются и становятся фиолетовыми. Теперь на табличке написано: NL NL #p«Кто #pвсе #pкарманы #pзолотом #pзабъёт. NL #pТому #pскоро #pбольшая #pотплата #pпридёт.» NL NL ",
      "Вы оставляете пустой горшок на своём месте, слегка беспокоясь о возможном наложенном ужасающем заклинании.",
      "Хотя вы слегка обеспокоены возможным наложенным ужасающим заклинанием, но подумав, что хуже уже не будет, вы забираете этот полезный горшочек с собой.",
      "Прислушавшись к табличке, вы достаёте из рюкзака несколько #yзолотых монет и бросате их в горшочек. Звук падающего #yзолота ~отражается~ от его металлических стенок, создавая очень приятный звук. NL NL Вы надеетесь, что более нуждающиеся путешественники оценят вашу награду.",
      "Тот, кто написал это, явно наложил какое-нибудь защитное заклинание или проклятие против того, кто посмеет прикоснуться к горшочку. ТАкая магия могла бы быть вам полезна. NL NL Правда вы знаете о снятии зачарований ровно столько же, сколько знают все. Поэтому вы хватаете табличку и разбиваете её об свою голову! Больно! NL NL Табличка взрывается фиолетовой пылью, осыпаясь на ваше тело и придавая ему новую силу. ООправившись от повреждения головы вы оглядываете округу, чтобы забрать горшочек, но его нет на месте. Воры Города должно быть ждали такой возможности, чтобы забрать добычу."
    ],
    "OPTIONS": [
      "[Пожертвовать] #rПотерять #r20 золота. #gПолучить #gВезение.",
      "[Закрыто] Требуется 20 золота.",
      "[Взять золото] #gПолучить #g75 золота. #rПолучить #rПроклятие #r- #rЖадность.",
      "[Взять горшочек] #gПолучить #g75 золота #gи #gЖелезный #gгоршок. #rПолучить #rдва #rПроклятия #r- #rЖадность.",
      "[Расколдовать] #rПотерять #r5 #rОЗ. #gПолучить #gТёмное #gзачарование.",
      "[Уйти]"
    ]
  },
  "${ModID}:GenieLamp": {
    "NAME": "Желание",
    "DESCRIPTIONS": [
      "«Парни, пойдём, эта фигня бесполезна.», замечаете вы трёх #rбандитов в комнате, мимо которой собирались пройти. NL NL Быстрым взглядом вы замечаете лишь неотчётливые очертания, за исключением #y~лампы~ прямо посередине. NL NL Пока вы тянулись к ней словно околдованный, из неё начал #p~клубить~ #pдым. NL NL « #p~Ки~ #p~Дини~ #p~воплотит~ #p~ваши~ #p~желания~ #p~в~ #p~реальность.~ »",
      "« #p~Знаний~ #p~в~ #p~достатке~ .», - сказав эти слова, #pдух исчез.",
      "« #p~Богатство~ #p~притягивает~ #p~жадность~ .», - сказав эти слова, #pдух исчез",
      "@Дым@ @окутывает@ @вас!@ NL NL В одно мгновение вы оказываетесь за пределами башни. Лёгкий ~шёпот~ проносится по ветру: « #pПобег #pиз #pодной #pтюрьмы #pв #pдругую.»"
    ],
    "OPTIONS": [
      "[Знаний] #yПолучить #yособую #yкарту.",
      "[Богатства] #gПолучить #g%d #gзолота. #rИзредко #rповышать #rстоимость #rреликвий #rв #rмагазине.",
      "[Свободы] #rПокинуть #yБашню.",
      "Продолжить."
    ]
  },
  "${ModID}:RoarOfTheCrowd": {
    "NAME": "Рёв толпы",
    "DESCRIPTIONS": [
      "Вы ненадолго останавливате подъём, чтобы оценить приветствующую вас толпу. Это место может ещё не так популярно как #bКолизей, но оно стремится к этому. NL NL На самом деле, толпа так взволнована, что они ворвались в башню и преграждают путь! Вам придётся договориться с ними, чтобы пройти вперёд. NL NL Пред вами как раз есть два хороших кандидата: #pфигура #pв #pптичьей #pмаске, которая хочет вашей #rкрови в обмен на #yзолото, и #bсиний #bгуманоид, который #gблагословит вас в обмен на маленькое #yпожертвование.",
      "Терять кровь #r~больно,~ но вы думаете о #yбогатствах, что ожидают вас.",
      "Заметив, что вы уже на пороге #rсмерти, культист пропускает вас не поранив. Вы заслуживаете награду, если вы сможете добиться с этим победы.",
      "Мягкое зелёное пламя окутывает ваше тело и исчезает. NL Существо улыбается. «Клирик лучший защитник. @Хорошего@ @дня!»@"
    ],
    "OPTIONS": [
      "[Культист] #rПотерять #r{0} #rОЗ. #gПолучить #g{1} #gзолота #gпосле #gпобеды #gнад #gбоссом #gбашни.",
      "[Клирик] #rПотерять #r{0} #rзолота. #gПолучить #g{1} #gЛовкости #gдо #gконца #gбашни.",
      "[Закрыто] Требуется {0} золота.",
      "[Уйти]"
    ]
  },
  "${ModID}:ArmorerEvent": {
    "NAME": "Оружейник",
    "DESCRIPTIONS": [
      "Накладывает 1 Уязвимости.",
      "Накладывает 1 Слабости.",
      "Вы берëте 1 карту.",
      "Даëт 2 Хрупкости.",
      "Даëт 1 Уязвимости.",
      "Даëт 2 Слабости.",
      "Сжигается.",
      "Эфирная.",
      "-2 урона & Защиты.",
      "Начальная.",
      "Оставляется.",
      "+2 урона & Защиты.",
      "Выберите #yАтаку или #yНавык, к которому хотите добавить «",
      "».",
      "Слабый лязг металла приводит вас к скрытой нише в башне. Внутри вы находите #rкультиста #rПробуждённого в #rкрасном плаще, который куёт изогнутую металлическую палку. NL NL «Ты не должен был видеть этого. Наш #bкульт требует, чтобы другие думали о нас как о дураках, так они остаются в неведении о нашем истинном потенциале. NL NL Я #yскую тебе что-нибудь, если ты клянёшься сохранить в секрете всё что увидел и забыть путь к этой комнате.»",
      "«Кузня требует #bбаланса во всём. Для #yусиления одного, надо #rухудшить другое.»",
      "«Эта #rжертва не должна быть напрасна. Выбирайте с умом.»",
      "Оружейница #yмастер своего дела, не прошло и минуты как она закончила свою работу. NL NL «Пусть это благословение станет #bподарком в твоём путешествии. Кузня будет светиться ещё немного... заплатив #rкровь или #yзолото, я смогу придать ещё одну форму металлу.»",
      "С последним шипением свет кузницы тухнет, #yосвещаемый только #yтеплом от инструментов. Она выглядит уставшей, и вернув ваше снаряжение #rпадает на скамейку. NL NL «Иди уже - и #bпомни о своём обещании. Ты #rникому не должен рассказывать об увиденном сегодня.»",
      "Вы отказываетесь от дальнейшей модификации вашего снаряжения. NL NL «Иди уже - и #bпомни о своём обещании. Ты #rникому не должен рассказывать об увиденном сегодня.»",
      "Оружейница снова #bмастерски куёт ваше снаряжение. «В кузнице осталось #rтоплива в точности для последнего раза. Если... ты желаешь #rзаплатить ещё.»",
      "Выберите #yАтаку или #yНавык для #rBane: «",
      "После битвы вы самостоятельно срываете железную маску с #rголовы #rоружейника. Какие бы #pуловки ни использовали эти #bкультисты, это не имеет значения - они нападали на вас и многих других. #rОни #rзаслужили #rсмерти."
    ],
    "OPTIONS": [
      "[Сохранить секрет] Добавить к 2 #yАтакам или #yНавыкам 1 #gхороший и 1 #rплохой модификатор.",
      "[Заплатить] #rПотерять #r10 #rОЗ.",
      "[Заплатить золотом] #rПотерять #r40 #rзолота.",
      " Модифицировать ещё карты.",
      "[Закрыто] Нет подходящих карт для: '",
      "[Закрыто] Уже использовано.",
      "[Уйти]",
      "[Убить] #rСражаться! #gПолучить #gШлем #gоружейника.",
      "[Закрыто] Не можете позволить."
    ]
  },
  "${ModID}:GentlemanEvent": {
    "NAME": "Загадочная фигура",
    "DESCRIPTIONS": [
      "Странный силуэт приближается к вам из переулка, его тело скрывают тени, а очертания едва различимы. NL #p«Похоже #pу #pтебя #pнебольшие #pпроблемы, #pмой #pдург. #pВозможно, #pя #pмогу #pпомочь... #pвсего-то #pв #pобмен #pна #p@твою@ #p@душу.»@",
      "Вы чувствуете, как силы возвращаются к вам... но часть внутри вас исчезла. Подняв взгляд, вы обнаруживаете, что силуэт пропал.",
      "#p«Ты #pсгинешь #pв #pэтом #pместе», - сказал он прежде чем раствориться в тени..."
    ],
    "OPTIONS": [
      "[Принять] #rПотерять ",
      ": #gВосполнить #gвсе #gОЗ.",
      "[Отклонить]"
    ]
  }
}